In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv(r'C:\Users\gamal\Downloads\Python Bootcamp For Data Science and ML\Pandas_Project_Session\data\automobile\Automobile_data.csv')
df.head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

In [3]:
df.dtypes

index                 int64
company              object
body-style           object
wheel-base          float64
length              float64
engine-type          object
num-of-cylinders     object
horsepower            int64
average-mileage       int64
price               float64
dtype: object

In [5]:
# As you can see there is no need for column index here so we gonna drop it.
df.drop('index',axis = 1 ,inplace = True)

In [6]:
df.head()

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

In [7]:
df['num-of-cylinders'].unique()

array(['four', 'six', 'five', 'three', 'twelve', 'two', 'eight'],
      dtype=object)

In [12]:
# We can replace those string values by a new ones in int type.

new_num = {'four':4 , 'six':6 , 'five':5 , 'three':3 , 'twelve':12 , 'two':2 , 'eight':8}

df.replace({'num-of-cylinders':new_num},inplace=True)

In [13]:
df.dtypes

company              object
body-style           object
wheel-base          float64
length              float64
engine-type          object
num-of-cylinders      int64
horsepower            int64
average-mileage       int64
price               float64
dtype: object

In [14]:
df.head()

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,alfa-romero,convertible,88.6,168.8,dohc,4,111,21,13495.0
1,alfa-romero,convertible,88.6,168.8,dohc,4,111,21,16500.0
2,alfa-romero,hatchback,94.5,171.2,ohcv,6,154,19,16500.0
3,audi,sedan,99.8,176.6,ohc,4,102,24,13950.0
4,audi,sedan,99.4,176.6,ohc,5,115,18,17450.0

In [15]:
# Check Null Values 
df.isna().sum()

company             0
body-style          0
wheel-base          0
length              0
engine-type         0
num-of-cylinders    0
horsepower          0
average-mileage     0
price               3
dtype: int64

In [19]:
# We can fill those null values with mean instead of drop them
df.fillna(df.mean(),inplace=True)

In [20]:
df.isna().sum()

company             0
body-style          0
wheel-base          0
length              0
engine-type         0
num-of-cylinders    0
horsepower          0
average-mileage     0
price               0
dtype: int64

In [21]:
# Now our data is clean for any analysis

To display the most expensive car company name; let's get the condition for the max price

In [23]:
max_price_cond = (df['price']==df['price'].max())

In [24]:
df[['company', 'price']][max_price_cond]

          company    price
35  mercedes-benz  45400.0

In [25]:
# we can also check the max price by obtaining the details on the data using describe method.

In [27]:
df.describe()

,wheel-base,length,num-of-cylinders,horsepower,average-mileage,price
count,61.000000,61.000000,61.000000,61.000000,61.000000,61.00000
mean,98.481967,173.098361,4.721311,107.852459,25.803279,15387.00000
std,6.679234,14.021846,1.495896,53.524398,8.129821,11033.62446
min,88.400000,141.100000,2.000000,48.000000,13.000000,5151.00000
25%,94.500000,159.100000,4.000000,68.000000,19.000000,6849.00000
50%,96.300000,171.200000,4.000000,100.000000,25.000000,12940.00000
75%,101.200000,177.300000,5.000000,123.000000,31.000000,17450.00000
max,120.900000,208.100000,12.000000,288.000000,47.000000,45400.00000

To display the details of all Toyota cars, we can use below condition on the data

In [29]:
Toyota_cond = df[(df.company=='toyota')]
Toyota_cond

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
48,toyota,hatchback,95.7,158.7,ohc,4,62,35,5348.0
49,toyota,hatchback,95.7,158.7,ohc,4,62,31,6338.0
50,toyota,hatchback,95.7,158.7,ohc,4,62,31,6488.0
51,toyota,wagon,95.7,169.7,ohc,4,62,31,6918.0
52,toyota,wagon,95.7,169.7,ohc,4,62,27,7898.0
53,toyota,wagon,95.7,169.7,ohc,4,62,27,8778.0
54,toyota,wagon,104.5,187.8,dohc,6,156,19,15750.0

In [30]:
# To display the total cars per company in the data set, we can use 'value_counts()' method on the column 'company'

In [32]:
df['company'].value_counts()

toyota           7
bmw              6
nissan           5
mazda            5
mercedes-benz    4
volkswagen       4
audi             4
mitsubishi       4
porsche          3
isuzu            3
jaguar           3
honda            3
chevrolet        3
alfa-romero      3
volvo            2
dodge            2
Name: company, dtype: int64

To get all companies with the highest price, we can group the data based on 'company' and selecting the column 'price' with max() attribute

In [33]:
new_data = df.groupby(by='company')

In [34]:
new_data['price'].max()

company
alfa-romero      16500.0
audi             18920.0
bmw              41315.0
chevrolet         6575.0
dodge             6377.0
honda            12945.0
isuzu            15387.0
jaguar           36000.0
mazda            18344.0
mercedes-benz    45400.0
mitsubishi        8189.0
nissan           13499.0
porsche          37028.0
toyota           15750.0
volkswagen        9995.0
volvo            13415.0
Name: price, dtype: float64

To display all company names with average mileage, we can group the data based on the 'company' and then selecting the column 'average-mileage' with mean() attribut to get the average mileage on the selected column

In [35]:
company_ave_mileage = df.groupby('company')

In [36]:
company_ave_mileage['average-mileage'].mean()

company
alfa-romero      20.333333
audi             20.000000
bmw              19.000000
chevrolet        41.000000
dodge            31.000000
honda            26.333333
isuzu            33.333333
jaguar           14.333333
mazda            28.000000
mercedes-benz    18.000000
mitsubishi       29.500000
nissan           31.400000
porsche          17.000000
toyota           28.714286
volkswagen       31.750000
volvo            23.000000
Name: average-mileage, dtype: float64

In order work with the 'num-of-cylinders', let's count how many cars are having the cylinders 'four' through 'twelve'

In [37]:
df['num-of-cylinders'].value_counts()

4     39
6     11
5      5
8      3
12     1
3      1
2      1
Name: num-of-cylinders, dtype: int64

In [38]:
# similarly we can count on 'horsepower'
df['horsepower'].value_counts()

68     7
62     6
101    4
70     4
69     3
182    3
100    2
207    2
184    2
123    2
110    2
111    2
176    2
114    2
52     2
88     2
85     1
72     1
76     1
78     1
121    1
262    1
154    1
156    1
102    1
152    1
48     1
115    1
55     1
288    1
Name: horsepower, dtype: int64

In [39]:
# and also on 'average-mileage'
df['average-mileage'].value_counts()

31    12
19     5
17     4
38     4
23     4
24     3
37     3
27     3
15     3
25     3
21     3
14     2
30     2
16     2
22     2
47     1
18     1
45     1
26     1
35     1
13     1
Name: average-mileage, dtype: int64

In [40]:
# Let's display all companies producing the cars with 'num-of-cylinders'is equal to'six'

In [42]:
df[(df['num-of-cylinders']==6)]

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
2,alfa-romero,hatchback,94.5,171.2,ohcv,6,154,19,16500.0
9,bmw,sedan,101.2,176.8,ohc,6,121,21,20970.0
10,bmw,sedan,103.5,189.0,ohc,6,182,16,30760.0
11,bmw,sedan,103.5,193.8,ohc,6,182,16,41315.0
12,bmw,sedan,110.0,197.0,ohc,6,182,15,36880.0
24,jaguar,sedan,113.0,199.6,dohc,6,176,15,32250.0
25,jaguar,sedan,113.0,199.6,dohc,6,176,15,35550.0
44,nissan,sedan,100.4,184.6,ohcv,6,152,19,13499.0
45,porsche,hardtop,89.5,168.9,ohcf,6,207,17,34028.0
46,porsche,convertible,89.5,168.9,ohcf,6,207,17,37028.0
54,toyota,wagon,104.5,187.8,dohc,6,156,19,15750.0

In [43]:
len(df[(df['num-of-cylinders']==6)])

11

Now it is our time to display all comapnies details which are producing the cars with 'average-mileage' greater than or equal to 35

In [44]:
final_data = df[(df['num-of-cylinders']==4) & (df['average-mileage'] >= 35)]

In [45]:
print(len(final_data))

9